# Занятие 1

Библиотека Pandas предоставляет классы и функционал для чтения, обработки и визуализации данных, хранящихся в различных форматах.

### Форматы данных

**CSV (от англ. Comma-Separated Values — значения, разделённые запятыми)** — текстовый формат, предназначенный для представления табличных данных. 
В pandas чтение данных с помощью pd.read_csv(), а запись - pd.to_csv().

In [96]:
import pandas as pd
import numpy as np
import json

In [58]:
df = pd.read_csv('Churn_Modelling.csv')

Посмотрим первые 10 строк загруженных данных:

In [59]:
df.head(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
5,6,15574012,Chu,645,Spain,Male,44,8,113755.78,2,1,0,149756.71,1
6,7,15592531,Bartlett,822,France,Male,50,7,0.00,2,1,1,10062.80,0
7,8,15656148,Obinna,376,Germany,Female,29,4,115046.74,4,1,0,119346.88,1
8,9,15792365,He,501,France,Male,44,4,142051.07,2,0,1,74940.50,0
9,10,15592389,H?,684,France,Male,27,2,134603.88,1,1,1,71725.73,0

Выведим последнии 5 строк датафрейма:

In [60]:
df.tail(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
9990,9991,15798964,Nkemakonam,714,Germany,Male,33,3,35016.60,1,1,0,53667.08,0
9991,9992,15769959,Ajuluchukwu,597,France,Female,53,4,88381.21,1,1,0,69384.71,1
9992,9993,15657105,Chukwualuka,726,Spain,Male,36,2,0.00,1,1,0,195192.40,0
9993,9994,15569266,Rahman,644,France,Male,28,7,155060.41,1,1,0,29179.52,0
9994,9995,15719294,Wood,800,France,Female,29,2,0.00,2,0,0,167773.55,0
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

Вывести заданное число случайно выбранных строк можно через:

In [65]:
df.sample(3)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
948,949,15783659,Blackburn,659,France,Male,67,4,145981.87,1,1,1,131043.20,0
2467,2468,15716518,Yuryeva,617,France,Female,27,4,0.00,2,0,0,190269.21,0
9400,9401,15584897,Kuo,639,France,Female,31,3,98360.03,1,0,0,20973.80,0

In [66]:
df.sample(3, random_state = 1)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
9953,9954,15655952,Burke,550,France,Male,47,2,0.00,2,1,1,97057.28,0
3850,3851,15775293,Stephenson,680,France,Male,34,3,143292.95,1,1,0,66526.01,0
4962,4963,15665088,Gordon,531,France,Female,42,2,0.00,2,0,1,90537.47,0

Отберём клиентов с CreditScore больше чем 500 и проживающих во Испании.

In [67]:
df_new = df[(df['CreditScore'] > 500) & ((df['Geography'] == 'Spain')|(df['Geography'] == 'Spain'))]

Посчитаем сколько таких клиентов:

In [68]:
len(df_new)

2339

In [69]:
df_new['rel'] = df['CreditScore'] / df['CreditScore'].mean()

C:\Users\medve\AppData\Local\Temp\ipykernel_21344\1456189035.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new['rel'] = df['CreditScore'] / df['CreditScore'].mean()

In [70]:
df_new = df[(df['CreditScore'] > 500) & ((df['Geography'] == 'Spain')|(df['Geography'] == 'Spain'))].copy()

In [71]:
df_new['rel'] = df['CreditScore'] / df['CreditScore'].mean()

In [72]:
df_new.columns

Index(['RowNumber', 'CustomerId', 'Surname', 'CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited', 'rel'],
      dtype='object')

Запишем получившийся срез оставив столбцы: CustomerId, Surname, CreditScore, Geography, Gender, Age, Balance, NumOfProducts и HasCrCard.

In [73]:
df_new[['CustomerId', 'Surname', 'CreditScore', 'Geography', 'Gender', 'Age', 'Balance', 'NumOfProducts', 'HasCrCard']].to_csv('scoring_data.csv', index = False)

**JSON (англ. JavaScript Object Notation)** — текстовый формат обмена данными, основанный на JavaScript. Изначально разработанный для JavaScript этот формат данных не зависит от языка программирования и подходит для хранения сложных данных.

Разработан формат JSON в начале 2000-х годов Дугласом Крокфордом.

В Python для создания данных JSON можно использовать вложенные словари. Каждый элемент во внешнем словаре соответствует столбцу в файле JSON.

Ключ каждого элемента – заголовок столбца, а значение – другой словарь, состоящий из строк столбца.

In [74]:
clients = {
         "Name":{"0":"John","1":"Nick","2":"Ali","3":"Joseph"},
         "Gender":{"0":"Male","1":"Male","2":"Female","3":"Male"},
         "Nationality":{"0":"UK","1":"French","2":"USA","3":"Brazil"},
         "Age" :{"0":10,"1":25,"2":35,"3":29}
}

Другой способ создания данных в формате JSON – использование списка словарей. 
Каждый элемент в списке состоит из словаря, а каждый словарь представляет строку. Этот подход удобнее для чтения, по сравнению с использованием вложенных словарей.

In [75]:
cars = [
    {"Name":"Honda", "Price": 10000, "Model":2005, "Power": 1300},
    {"Name":"Toyota", "Price": 12000, "Model":2010, "Power": 1600},
    {"Name":"Audi", "Price": 25000, "Model":2017, "Power": 1800},
    {"Name":"Ford", "Price": 28000, "Model":2009, "Power": 1200},
         
]

Для записи данных в формате JSON есть модуль json и метод dump().

In [76]:
with open('clients.json', 'w') as f:
    json.dump(clients, f)
    
with open('cars.json', 'w') as f:
    json.dump(cars, f)

Для загрузки данных в формате JSON нам потребуется метод read_json().

In [77]:
clients_df = pd.read_json('clients.json')
clients_df.head()

     Name  Gender Nationality  Age
0    John    Male          UK   10
1    Nick    Male      French   25
2     Ali  Female         USA   35
3  Joseph    Male      Brazil   29

In [79]:
cars_df = pd.read_json('cars.json')
cars_df.head()

     Name  Price  Model  Power
0   Honda  10000   2005   1300
1  Toyota  12000   2010   1600
2    Audi  25000   2017   1800
3    Ford  28000   2009   1200

Загрузить файл находящийся на удалённом сервере можно через:

In [81]:
iris_data = pd.read_json("https://raw.githubusercontent.com/domoritz/maps/master/data/iris.json")
iris_data.head()

   sepalLength  sepalWidth  petalLength  petalWidth species
0          5.1         3.5          1.4         0.2  setosa
1          4.9         3.0          1.4         0.2  setosa
2          4.7         3.2          1.3         0.2  setosa
3          4.6         3.1          1.5         0.2  setosa
4          5.0         3.6          1.4         0.2  setosa

In [82]:
iris_data.to_json('iris_data.json')

In [134]:
data = [{'id': 1, 'name': {'first': 'Coleen', 'last': 'Volk'}},
        {'name': {'given': 'Mose', 'family': 'Regner'}},
        {'id': 2, 'name': 'Faye Raker'}]

pd.json_normalize(data)

    id name.first name.last name.given name.family        name
0  1.0     Coleen      Volk        NaN         NaN         NaN
1  NaN        NaN       NaN       Mose      Regner         NaN
2  2.0        NaN       NaN        NaN         NaN  Faye Raker

Модуль **pickle** позволяет выполнять сериализацию и десериализацию объектов Python. 

"Pickling" - процесс преобразования объекта Python в поток байтов, а "unpickling" - обратная операция, в результате которой поток байтов преобразуется обратно в Python-объект. Так как поток байтов легко можно записать в файл, модуль pickle широко применяется для сохранения и загрузки сложных объектов в Python.

In [125]:
import pickle

data = {'a': [1, 2.0, 3, 4+6j],
        'b': ("character string", b"byte string"),
        'c': {None, True, False}
       }

In [126]:
with open('data.pickle', 'wb') as f:
    pickle.dump(data, f)

In [127]:
with open('data.pickle', 'rb') as f:
    data_new = pickle.load(f)

In [128]:
print(data_new)

{'a': [1, 2.0, 3, (4+6j)], 'b': ('character string', b'byte string'), 'c': {False, True, None}}

## Практические задания (повторение pandas)

1. Загрузите данные с 'https://raw.githubusercontent.com/Grossmend/CSV/master/titanic/data.csv' и переведите каждую 100-ую строку в DataFrame.

2. В датасете из задания 1 проверьте наличие пропусков (рассчитайте число и процент пропусков), корректность типов данных и выводите общую информацию о датафрейме. Измените тип столбца Age на целочисленный.

3. Как найти евклидово расстояние между двумя Series (точками) a и b, не используя встроенную формулу?

In [145]:
a = pd.Series([2, 4, 6, 8])
b = pd.Series([1, 3, 5, 7])

4. Найдите максимально возможное абсолютное значение корреляции каждого столбца с другими столбцами в df?

In [99]:
df = pd.DataFrame(np.random.randint(1, 100, 16).reshape(4, 4), columns=list('efgh'), index=list('abcd'))
df

    e   f   g   h
a   8  43  98  74
b  48   8  97  30
c  80  41   7  69
d  52  30  20  85

5. Объедините df1 и df2 по столбцам fruit-frukt и weight-ves.

In [102]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['low', 'medium', 'high'] * 3,
                    'price': np.random.randint(0, 100, 9)})

df2 = pd.DataFrame({'frukt': ['apple', 'banana', 'melon'] * 2,
                    'ves': ['low', 'high'] * 3,
                    'price': np.random.randint(0, 100, 6)})

6. Создайте новый столбец, который содержит номера ближайших по евклидовому расстоянию столбцов?

In [135]:
df = pd.DataFrame(np.random.randint(1, 100, 16).reshape(4, 4), columns=list('efgh'), index=list('abcd'))
df

    e   f   g   h
a  41  60  68  84
b  81  43  46  32
c  78  16  97  16
d  92  91   8  40

7. Нужно найти не пересекающиеся элементы в двух объектах Series:

In [136]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([4, 5, 6, 7, 8])

8. Нужно найти индексы объекта Series кратные 3.

In [112]:
s = pd.Series(np.random.randint(low=1, high=10, size=[7]))

9. Необходимо объеденить два объекта Series вертикально и горизонтально.

In [116]:
s1 = pd.Series(range(5))
s2 = pd.Series(list('abcde'))

10. Получить объект Series, который содержит элементы без повторений объекта A.

In [118]:
s = pd.Series(np.random.randint(low=1, high=10, size=[10]))

11. Преобразуйте каждый символ объекта Series в нижний регистр.

In [122]:
s = pd.Series(['Python', 'for', 'data', 'analysis'])

12. Загрузите данные в формате JSON (см. статью https://habr.com/ru/companies/otus/articles/731844/).

In [137]:
data = pd.read_json('airlines.json')
data

,Airport,Time,Statistics
0,"{'Code': 'ATL', 'Name': 'Atlanta, GA: Hartsfie...","{'Label': '2003/06', 'Month': 6, 'Month Name':...","{'# of Delays': {'Carrier': 1009, 'Late Aircra..."
1,"{'Code': 'BOS', 'Name': 'Boston, MA: Logan Int...","{'Label': '2003/06', 'Month': 6, 'Month Name':...","{'# of Delays': {'Carrier': 374, 'Late Aircraf..."
2,"{'Code': 'BWI', 'Name': 'Baltimore, MD: Baltim...","{'Label': '2003/06', 'Month': 6, 'Month Name':...","{'# of Delays': {'Carrier': 296, 'Late Aircraf..."
3,"{'Code': 'CLT', 'Name': 'Charlotte, NC: Charlo...","{'Label': '2003/06', 'Month': 6, 'Month Name':...","{'# of Delays': {'Carrier': 300, 'Late Aircraf..."
4,"{'Code': 'DCA', 'Name': 'Washington, DC: Ronal...","{'Label': '2003/06', 'Month': 6, 'Month Name':...","{'# of Delays': {'Carrier': 283, 'Late Aircraf..."
...,...,...,...
4403,"{'Code': 'SAN', 'Name': 'San Diego, CA: San Di...","{'Label': '2016/01', 'Month': 1, 'Month Name':...","{'# of Delays': {'Carrier': 280, 'Late Aircraf..."
4404,"{'Code': 'SEA', 'Name': 'Seattle, WA: Seattle/...","{'Label': '2016/01', 'Month': 1, 'Month Name':...","{'# of Delays': {'Carrier': 357, 'Late Aircraf..."
4405,"{'Code': 'SFO', 'Name': 'San Francisco, CA: Sa...","{'Label': '2016/01', 'Month': 1, 'Month Name':...","{'# of Delays': {'Carrier': 560, 'Late Aircraf..."
4406,"{'Code': 'SLC', 'Name': 'Salt Lake City, UT: S...","{'Label': '2016/01', 'Month': 1, 'Month Name':...","{'# of Delays': {'Carrier': 338, 'Late Aircraf..."
4407,"{'Code': 'TPA', 'Name': 'Tampa, FL: Tampa Inte...","{'Label': '2016/01', 'Month': 1, 'Month Name':...","{'# of Delays': {'Carrier': 410, 'Late Aircraf..."

13. Сохраните датафрейм с 'https://raw.githubusercontent.com/Grossmend/CSV/master/titanic/data.csv' в формате pickle.

In [ ]:
14. Дана Series из дат. Нужно преобразовать к единому формату даты.

In [150]:
s = pd.Series(['2021/01/01', '2011-01-02', '12 Jan 2017'])

15. Замените все элементы объекта Series на "Other", кроме двух наиболее часто встречающихся.

In [152]:
state = np.random.RandomState(123)
s = pd.Series(state.randint(low=1, high=5, size=[13]))